Revit 2027 API
TableSectionData.SetRowHeight Method
 Sets a row's height in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRowHeight(
	int nRow,
	double height
)
Public Sub SetRowHeight (
	nRow As Integer,
	height As Double
)
public:
void SetRowHeight(
	int nRow,
	double height
)
member SetRowHeight :
        nRow : int *
        height : float -> unit
Parameters
nRow Int32
height Double
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The row height is outside of acceptable range.
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace